# Pandas
<a href="https://colab.research.google.com/github/restrepo/ComputationalMethods/blob/master/material/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

From http://pandas.pydata.org/pandas-docs/stable/

pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it has the broader goal of becoming the most powerful and flexible open source data analysis / manipulation tool available in any language. It is already well on its way toward this goal.

See also:

* https://github.com/restrepo/data-analysis
  * https://classroom.github.com/g/sSMBdBqN
  * https://classroom.github.com/a/PcbQBE7F
* https://github.com/restrepo/PythonTipsAndTricks
* https://pbpython.com/excel-pandas-comp.html [[archive.org](https://web.archive.org/web/20201126143453/https://pbpython.com/excel-pandas-comp.html)]

A good and practice book about `Pandas` possibilities is:

[__Python for Data Analysis__](https://drive.google.com/open?id=0BxoOXsn2EUNIWExXbVc4SDN0YTQ)<br/>
Data Wrangling with Pandas, NumPy, and IPython<br/>
_By William McKinney_


This other is about aplications based on `Pandas`:
![image.png](https://covers.oreillystatic.com/images/0636920030515/cat.gif) [Introduction to Machine Learning with Python](https://drive.google.com/open?id=0BxoOXsn2EUNISGhrdEZ3S29fS3M)<br/>
A Guide for Data Scientists
By Sarah Guido, Andreas Müller

`Pandas` can be used in a similar way to `R`, which is based on similar data structures. `Pandas` also can replace the use of graphical interfaces to access spreadsheets like Excel

## Standard way to load the module

In [232]:
import pandas as pd

## Basic structure: DataFrame

An flat _spreadsheet_ can be seen in terms of the types of variables of `Python` just as dictionary of lists, where each column of the spreadsheet is a pair key-list of the dictionary 

|   |  A   |  B   |
|---|:----:|:----:|
| 1 | even | odd  |
| 2 |   0  | 1    |
| 3 |   2  | 3    |
| 4 |   4  | 5    |
| 5 |   6  | 7    |
| 6 |   8  | 9    |

In [233]:
numbers={"even": [0,2,4,6,8],   #  First  key-list
         "odd" : [1,3,5,7,9] }  #  Second key-list

## Data structures

`Pandas` has two new data structures:
1. `DataFrame` which are similar to numpy arrays but with some assigned key. For example, for the previous case
```python
import numpy as np
np.array([[0,1],
          [2,3],
          [4,5],
          [6,7],
          [8,9] 
         ])
```
1. `Series` which are enriched  to dictionaries, as the ones defined for the rows of the previous example: `{'even':0,'odd':1}`.


The rows in a two-dimensional `DataFrame` corresponds to `Series` with similar keys, while the columns are also Series with the indices as keys. 

An example of a  `DataFrame` is a spreadsheet, as the one before.

### `DataFrame`
`Pandas` can convert a dictionary of lists, like the `numbers` dictionary before, into a `DataFrame`, which is just an spreadsheet but interpreted at the programming level:

In [234]:
numbers

{'even': [0, 2, 4, 6, 8], 'odd': [1, 3, 5, 7, 9]}

In [235]:
import pandas as pd
df=pd.DataFrame(numbers)
df

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

It is equivalent to:

In [236]:
df.to_dict()

{'even': {0: 0, 1: 2, 2: 4, 3: 6, 4: 8}, 'odd': {0: 1, 1: 3, 2: 5, 3: 7, 4: 9}}

In [237]:
pd.DataFrame(  {'even': {0: 0, 1: 2, 2: 4, 3: 6, 4: 8}, 'odd': {0: 1, 1: 3, 2: 5, 3: 7, 4: 9}} )

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

In [238]:
pd.DataFrame.from_dict(numbers)

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

See below for other possibilities of [creating Pandas DataFrames from lists and dictionaries](https://fisica.udea.edu.co:4443/user/restrepo/notebooks/prog/cursos/data-analysis/Pandas.ipynb#Intialization-from-lists-and-dictionaries)

The main advantage of the `DataFrame`, `df`, is that it can be managed without a graphical interface.

We can check the shape of the `DataFrame`

In [239]:
df.shape

(5, 2)

####  Export DataFrame to other formats
* To export to excel:

In [240]:
df.to_excel('example.xlsx',index=False)

In [241]:
newdf=pd.read_excel('example.xlsx')
newdf

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

__Activity__: Open the resulting spreadsheet in Google Drive, publish it and open from the resulting link with Pandas in the next cell

In [242]:
df.to_excel('exercise.xlsx',index=False)

df=pd.read_excel('exercise.xlsx')
df

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

### `Series`

Each column of the DataFrame is now an augmented dictionary called `Series`, with the indices as the keys of the `Series`

A `Pandas` `Series` object can be just initialized from a `Python` dictionary:

In [243]:
type( df['even'] )

pandas.core.series.Series

The keys are the index of the `DataFrame`

In [244]:
#df['even']
df.even[4]

8

Each row is also a series

In [245]:
df.loc[0]

even    0
odd     1
Name: 0, dtype: int64

with keys: `'even'` and `'odd'`

In [246]:
df.loc[0]['even']

0

or attributes `even` and `odd`

In [247]:
df.loc[0].odd

1

One specific cell value can be reached with the index and the key:

In [248]:
df.loc[2,'odd']

5

In [249]:
s=pd.Series({'Name':'Juan Valdez','Nacionality':'Colombia','Age':23})
s

Name           Juan Valdez
Nacionality       Colombia
Age                     23
dtype: object

*Note* that the key name can be used also as an attribute.

In [250]:
df.odd

0    1
1    3
2    5
3    7
4    9
Name: odd, dtype: int64

> The __power__ of Pandas rely in that their main data structures: `DataFrames` and `Series`, are enriched with many useful methods and attributes.

### [Official definition of Pandas](http://pandas.pydata.org/pandas-docs/stable/)

> Pandas is a Python package providing __fast__, __flexible__, and __expressive__ _data structures_ designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it _has the broader goal of becoming the most powerful and flexible open source data analysis / manipulation tool_ available in any language. It is already well on its way toward this goal.

* "relational": the list of data is identified with some unique index (like a `SQL` table)
* "labeled": the list is identified with a key, like the previous `odd` or `even` keys.

For example. A double bracket `[[...]]`, can be used to filter data.

A row in a two-dimensional `DataFrame` corresponds to `Series` with the same keys of the `DataFrame`, but with single values instead of a list

In [251]:
df.loc[[0]]

   even  odd
0     0    1

In [252]:
print( 'the row has' )
print( '                  keys: {} and values: {}'.format( list( df.loc[[0]].keys() ),df.loc[[0]].values[0]  ) )
print( "like the dictionay:" )
print( "                      { 'even' : 0, 'odd' : 1 }")

the row has
                  keys: ['even', 'odd'] and values: [0 1]
like the dictionay:
                      { 'even' : 0, 'odd' : 1 }

To filter a column:

In [253]:
df[['odd']]

   odd
0    1
1    3
2    5
3    7
4    9

### More on `Series`

A `Pandas` `Series` object can be just initialized from a `Python` dictionary:

In [254]:
s=pd.Series({'Name':'Juan Valdez','Nacionality':'Colombia','Age':23})
s

Name           Juan Valdez
Nacionality       Colombia
Age                     23
dtype: object

In [255]:
s['Name']

'Juan Valdez'

but also as containers of name spaces!

In [256]:
s.Name

'Juan Valdez'

## `DataFrame` initialization

### Initization from an existing spreadsheet. 
This can be locally in your computer o from some downloadable  link

In [257]:
df=pd.read_excel('http://bit.ly/spreadsheet_xlsx')
df

               Nombre  Edad                Compañia
0         Juan Valdez    23        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

To make a downloadable link for any spread sheet in Google Drive, follow the sequence:
```
File → Publish to the web...→ Entire Document → Web page → Microsoft excel (xlsx)
```
as illustrated in the figure:
![GS](https://github.com/restrepo/data-analysis/blob/master/img/img1.png?raw=1)

In [258]:
df.loc[0,'Edad']=32
#df.at[0,'Edad']=32
df

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

*After* some modification

it can be saved again as an `excel file` with the option to not create a column of indices: `index=False`

### Intialization from lists and dictionaries

#### Inizialization from Series
We start with an empty `DataFrame`:

Creating Pandas DataFrame from list and dictionaries [offers many alternatives](http://pbpython.com/pandas-list-dict.html)

![creating dataframes](http://pbpython.com/images/pandas-dataframe-shadow.png)

#### Row oriented way
* In addition to the dictionary of lists [already illustrated at the beginning]() that in this case corresponds to:

In [259]:
pd.DataFrame({'Nombre'   : ['Juan Valdez','Álvaro Uribe Vélez'],
              'Edad'     : [32,            65                 ],
              'Compañia' : ['Café de Colombia','Senado de la República']})

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

* We can obtain the DataFrame from list of items

In [260]:
pd.DataFrame([ [ 'Nombre'  , ['Juan Valdez','Álvaro Uribe Vélez']],
                          [ 'Edad'    , [  32,            65               ]],
                          [ 'Compañia', ['Café de Colombia','Senado de la República']] ])

          0                                           1
0    Nombre           [Juan Valdez, Álvaro Uribe Vélez]
1      Edad                                    [32, 65]
2  Compañia  [Café de Colombia, Senado de la República]

* We can obtain the `DataFrame` from dictionary

In [261]:
pd.DataFrame( [{'Nombre':'Juan Valdez',        'Edad': 32   ,'Compañia':'Café de Colombia'      },
              {'Nombre':'Álvaro Uribe Vélez', 'Edad': 65   ,'Compañia':'Senado de la República'}]
            )

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

In [262]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

### Initialization from sequential rows as  Series
We start with an empty `DataFrame`:

In [263]:
df=pd.DataFrame()
df.empty

True

We can append a dictionary (or Series) as a row of the `DataFrame`, provided that we always use the option: `ignore_index=True`

In [264]:
d={'Name':'Juan Valdez','Nacionality':'Colombia','Age':23}
df=df.append(d,ignore_index=True)
df

    Age Nacionality         Name
0  23.0    Colombia  Juan Valdez

We can fix the type of data of the `'Age'` column

In [265]:
type(df.Age[0])

numpy.float64

In [266]:
df['Age']=df.Age.astype(int)
df

   Age Nacionality         Name
0   23    Colombia  Juan Valdez

To add a second file we build another `dict`

In [267]:

import numpy as np
d={}
for k in ['Name','Nacionality','Age','Company']:
    var=input('{}:\n'.format(k))
    if var == '':
      var = np.nan
    d[k]=var

Name:
mateo
Nacionality:

Age:

Company:

#### Exercises
* Display the resulting `Series` in the screen:

In [268]:
d

{'Age': nan, 'Company': nan, 'Nacionality': nan, 'Name': 'mateo'}

* Append to the previous `DataFrame` and visualize it:

In [269]:
df=df.append(d,ignore_index=True)
df

    Age Nacionality         Name  Company
0  23.0    Colombia  Juan Valdez      NaN
1   NaN         NaN        mateo      NaN

* Fill NaN with empty strings

In [270]:
df=df.fillna('indetermida')
df

           Age  Nacionality         Name      Company
0           23     Colombia  Juan Valdez  indetermida
1  indetermida  indetermida        mateo  indetermida

* Save `Pandas` `DataFrame` as an Excel file

In [271]:
df.to_excel('prof.xlsx',index=False)

* Load pandas DataFrame from the saved file in Excel

In [272]:
pd.read_excel('prof.xlsx')

           Age  Nacionality         Name      Company
0           23     Colombia  Juan Valdez  indetermida
1  indetermida  indetermida        mateo  indetermida

### Common operations upon `DataFrames`
See https://github.com/restrepo/PythonTipsAndTricks

* __To fill a specific cell__

In [273]:
df.at[0,'Company']='Federación de Caferos'

In [274]:
df

           Age  Nacionality         Name                Company
0           23     Colombia  Juan Valdez  Federación de Caferos
1  indetermida  indetermida        mateo            indetermida

## Other formats to saving and read files
We are interested in format which keeps the tags of the columns, like `'Nombre', 'Edad', 'Compañia'`

In [275]:
df=pd.read_excel('http://bit.ly/spreadsheet_xlsx')
df

               Nombre  Edad                Compañia
0         Juan Valdez    23        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

In [276]:
type(df.loc[0,'Edad'])

numpy.int64

#### CSV

In [277]:
df.to_csv('hoja.csv',index=False)

We can check the explicit file format with

In [278]:
df.to_csv(None,index=False)

'Nombre,Edad,Compañia\nJuan Valdez,23,Café de Colombia\nÁlvaro Uribe Vélez,65,Senado de la República\n'

In [279]:
print(df.to_csv(None,index=False))

Nombre,Edad,Compañia
Juan Valdez,23,Café de Colombia
Álvaro Uribe Vélez,65,Senado de la República

In [280]:
pd.read_csv('hoja.csv')

               Nombre  Edad                Compañia
0         Juan Valdez    23        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

#### JSON

This format keeps the Python lists and dictionaries at the storage level

In [281]:
df=pd.DataFrame([{"Name":"Donald Trump","Age":74},
                 {"Name":"Barak Obama", "Age":59}])
df

           Name  Age
0  Donald Trump   74
1   Barak Obama   59

This format allow us to keep exactly the very same list of dictionaries structure!

In [282]:
print(df.to_json(None,orient='records'))

[{"Name":"Donald Trump","Age":74},{"Name":"Barak Obama","Age":59}]

__Activity__: 
* Save to a file instead of `None` and open the file with some editor.

In [283]:
df.to_json('presidents.json',orient='records')
r = pd.read_json('presidents.json',orient='records')
r

           Name  Age
0  Donald Trump   74
1   Barak Obama   59

* Add a break-line at the end of the first dictionary and try to
load the resulting file with `pd.read_json`

In [284]:
pd.read_json('presidents.json')

           Name  Age
0  Donald Trump   74
1   Barak Obama   59

JSON allows for some flexibility in the break-lines structure:

In [285]:
hm='''
hola
mundo
'''

In [286]:
hm

'\nhola\nmundo\n'

In [287]:
pd.read_json('''
             [{"Name":"Donald Trump","Age":73},
              {"Name":"Barak Obama", "Age":58}]
            ''')

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

For large databases it is convinient just to accumulate dictionaries in a sequential form:

In [288]:
print(df.to_json(None,orient='records',lines=True))

{"Name":"Donald Trump","Age":74}
{"Name":"Barak Obama","Age":59}

In [289]:
pd.read_json('''
             {"Name":"Donald Trump","Age":73}
             {"Name":"Barak Obama", "Age":58}
            ''',orient='records',lines=True)

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

__Activity__: 
* Save to a file instead of `None`, with options: `orient='records',lines=True`, and open the file with some editor.

In [290]:
df.to_json('presidents.json',orient='records',lines=True)
r2 = pd.read_json('presidents.json',orient='records',lines=True)
r2

           Name  Age
0  Donald Trump   74
1   Barak Obama   59

In [291]:
dg=pd.DataFrame([{"Nombre":"mateo","Age":19,"profesion":"erudito"},
                 {"Nombre":"marlon","Age":19,"profesion":"carrito"},
                 {"Nombre":"mari","Age":19,"profesion":"arquitecta"}])
dg.to_json('bros.json',orient='records',lines=True)
rf3 = pd.read_json("bros.json",orient='records',lines=True)
rf3

   Nombre  Age   profesion
0   mateo   19     erudito
1  marlon   19     carrito
2    mari   19  arquitecta

* Add a similar dictionary in the next new line, and try to
load the resulting file with `pd.read_json` with options: `orient='records',lines=True`. 
   * WARNING: Use doble-quotes `"` to write the keys od the new
dictionary

Any Python string need to be converted first to double-quotes before to be used as JSON string.

__Example__

In [292]:
numbers={"even": [0,2,4,-6,8],   #  First  key-list
         "odd" : [1,3,-5,7,9] }  #  Second key-list

In [293]:
numbers

{'even': [0, 2, 4, -6, 8], 'odd': [1, 3, -5, 7, 9]}

In [294]:
str(numbers)

"{'even': [0, 2, 4, -6, 8], 'odd': [1, 3, -5, 7, 9]}"

This string can be writing in the `JSON` format by replacing the single quotes, ' , by  duoble quotes, ":

In [295]:
str(numbers).replace("'",'"')

'{"even": [0, 2, 4, -6, 8], "odd": [1, 3, -5, 7, 9]}'

and now can be used as an JSON input

In [296]:
df=pd.read_json(  str(numbers).replace("'",'"') )
df

   even  odd
0     0    1
1     2    3
2     4   -5
3    -6    7
4     8    9

__Activity__: Try to read the string as JSON without make the double-quote replacement

In [ ]:
dh = pd.read_json(str(numbers))
dj = str(numbers)
dj.to_json('intento.json',orient='records',lines=True)

dh = pd.read_json(str(numbers))
"""
se intento mas no se logro
"""

## Filters
The main application of labeled data for data analysis is the possibility to make filers, or cuts, to obtain specific reduced datasets to further analysis

In [231]:
df

           Name  Age
0  Donald Trump   74
1   Barak Obama   59

In [298]:
df[df.even.abs()>4]

   even  odd
3    -6    7
4     8    9

In [299]:
#and
df[(df.even>0) & (df.odd<0)]

   even  odd
2     4   -5

In [300]:
df[~((df.even>0) & (df.odd<0)) ]

   even  odd
0     0    1
1     2    3
3    -6    7
4     8    9

In [301]:
#or
df[(df.even<0) | (df.odd<0)]

   even  odd
2     4   -5
3    -6    7

## The `apply` method
The advantage of the spreadsheet paradigm is that the columns can be transformed with functions. All the typical functions avalaible for a spreadsheet are already implemented like the method `.abs()` used before, or the method: `.sum()`

In [302]:
df.even.sum()

8

__Activity__: Explore the avalaible methods by using the completion system of the notebook after the last semicolon of `df.even.`

In [ ]:
df.even.abs()
df.even.add(3)
df.even.agg()
df.even.all()
df.even.argsort(3)

In addittion, for the `DataFrame` paradigm, we can easy implement any other function directly at the programming level either along the columns or along the rows

### Column-level `apply`
We just select the column and apply the direct or implicit function:
* Pre-defined function

In [ ]:
df.even.apply(abs)

* Implicit function

In [ ]:
df.even.apply(lambda n:isinstance(n,int))

In [ ]:
df.even.apply(lambda n: n**2)

### Row-level apply
The foll row is passed as dictionary to the explicit or implicit function when `apply` is used for the full `DataFrame` and the option `axis=1` is used at the end

In [ ]:
df['even']+df['odd']

In [ ]:
df.apply(lambda row: row['even']+row['odd']**2,axis='columns')

## Chain tools for data analysis
There are several chain tools for data analyis like the
* Spreadsheet based one, like Excel 
* Relational databases with the use of more advanced SQL tabular data with some data base software like MySQL
* Non-relational databases with Pandas, R, or MongoDB

Here we illustrate an example of use fo a non-relational database with Pandas

## Relational databases

In [ ]:
df=pd.read_excel('http://bit.ly/spreadsheet_xlsx')
persona=df[['Nombre','Edad']]

In [ ]:
persona['id']=[888,666]
persona

In [ ]:
d1={'id':888, 'Inicio':2010,'Fin:':None,'Cargo':'Arriero','Compañía':'Café de Colombia'}
d2={'id':666, 'Inicio':2013,'Fin:':2020,'Cargo':'Senador','Compañía':'Senado de la República de Colombia'}
d3={'id':666, 'Inicio':2020,'Fin:':None,'Cargo':'Influencer','Compañía':'Twitter'}
trabajo=pd.DataFrame( [d1,d2,d3] )  
trabajo

## Non-relational databases

We have shown that the simple two dimensional spreadsheets where each cell values is a simple type like string, integer, or float, can be represented as a dictionary of lists values or a list of dictionary column-value assignment. 

We can go further and allow to store in the value itself a more general data structure, like nested lists and dictionaries. This allows advanced data-analysis when the `apply` methos is used to operate inside the nested lists or dictionaries.

See for example:

##  World wide web
There are really three kinds of web
* The normal web, 
* The deep web,
* _The machine web_. The web for machine readable responses. It is served in `JSON` or `XML`  formats, which preserve programming objects.

### Normal web

In [221]:
pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_by_country_and_territory')[1][:3]

                                                   0                                                  1
0  Confirmed total cases by country as of 22 Mar ...  Confirmed cases per 100,000 by country or sub-...

### Machine web
For example, consider the following normal web page:

http://old.inspirehep.net/search?p=doi:10.1103/PhysRevLett.122.132001

about a Scientific paper with people from the University of Antioquia. A _machine web_ version can be easily obtained in JSON just by attaching the extra parameter `&of=recjson`, and direcly loaded from Pandas, which works like a _browser for the third web_:

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_json('http://old.inspirehep.net/search?p=doi:10.1103/PhysRevLett.122.132001&of=recjson')

In [ ]:
df

We can see that the column `authors` is quite nested: Is a list of dictionaries with the full information for each one of the authors of the article.

In [ ]:
df.columns

In [ ]:
df.number_of_authors

In [ ]:
df.authors

__Activity__: Check that the lenght of the auhors list coincides with the `number_of_authors` 
<!-- df.authors.apply(len),df.number_of_authors.values -->

In [ ]:
df.authors[0][0]

 We can use all the previous methods to extract the authors from `'Antioquia U.'`:
 
 Note: For a dictionary, `d` is safer to use `d.get('key')` instead of just `d['key']` to obtain some `key`, because not error is generated if the requested `key` does not exists at all

We also need use comprenhension list like in

In [ ]:
l=[1,2,3]

In [ ]:
[x if x>1 else 3 for x in l ]

Then the on-fly apply function to extract the authors with affiliation 'Antioquia U.' is

In [ ]:
df.authors.apply(lambda l:  #implicit function
                           [ d.get('full_name') #safer way to obtain a `key` value
                             for d in l   #comprehension list 
                              if isinstance(d,dict) and d.get('affiliation')=='Antioquia U.' #condition
                           ] 
                             if isinstance(l,list) else None #  Be sure that cell have the proper format
                 )

A simpler version is possible,  but is more prompted to error when used through multiple column entries:

In [ ]:
df.authors.apply(lambda l: [ d['full_name'] for d in l   
                              if d['affiliation']=='Antioquia U.'
                           ] )

For further details see: https://github.com/restrepo/inspire/blob/master/gfif.ipynb

__Activity__: Repeat the same activity but using directly the JSON file

__NOTE__: The same but with the new API

In [ ]:
#See: https://github.com/inspirehep/rest-api-doc/issues/4#issuecomment-645218074
import requests                                                                                                                                                      
response = requests.get('https://inspirehep.net/api/doi/10.1103/PhysRevLett.122.132001')                                                                              
authors = response.json()['metadata']['authors']                                                                                                                     
names = [author.get('full_name')
              for author in authors 
               if any(aff.get('value') == 'Antioquia U.' for aff in author.get('affiliations'))]
names

##  ACTIVITIES
See:
* https://github.com/ajcr/100-pandas-puzzles
* https://github.com/guipsamora/pandas_exercises

## Final remarks
With basic scripting and Pandas we already have a solid environment to analyse data. We introduce the other libraries motivated with the extending the capabilities of Pandas